CassiniSea/lcd-st7735-stm8s/main.c
/* MAIN.C file
 * 
 * Copyright (c) 2002-2005 STMicroelectronics
 
a1 - button 3
a2 - button 4
a3 - motor (tim2_ch3)

b4(T) - 
b5(T) - led

c3 - button 1
c4 - term (ain2)
c5 - lcd sck
c6 - lcd mosi
c7 - button 2

d2 - lcd a0
d3 - lcd cs
d4 - heater control
d5 - uart tx
d6 - uart rx

										 3.3V        12V
										 |         |
										 |				 Heater
										 |         |
										 |     |---|
										 R2k   |<-?
										 |_____|---|
										 /         |
									 |/          |
		d4 --- R256 ---|           |
									 |\|         |
										-\         |
										 |         |
										___       ___
										 -         -
						 3.3V
						 |
						 R150
						 |
AIN2(C4) --- *
             |
						 Thermistor
						 |
						___
						 -
 */
 
#include "stm8s.h"
#include "uart.h"
#include "eeprom.h"
#include "math.h"

#define ST7735_PORT GPIOD
#define ST7735_CS_PIN GPIO_PIN_3
#define ST7735_A0_PIN GPIO_PIN_2
#define ST7735_DELAY 0xFF
#define ST7735_BLACK    0x0000
#define ST7735_RED      0xF800
#define ST7735_GREEN    0x07E0
#define ST7735_BLUE     0x001F
#define ST7735_WHITE    0xFFFF
#define ST7735_YELLOW   0xFFE0
#define ST7735_CYAN     0x07FF
#define ST7735_MAGENTA  0xF81F
#define ST7735_GREY			0x630C

#define SCREEN_WIDTH       160
#define SCREEN_HEIGHT      128

#define BUTTONS_DEBOUNCE_LIMIT 20

#define EVENT_BUTTON_1_PRESSED  1
#define EVENT_BUTTON_2_PRESSED  (1<<1)
#define EVENT_BUTTON_3_PRESSED  (1<<2)
#define EVENT_BUTTON_4_PRESSED  (1<<3)
#define EVENT_BUTTON_5_PRESSED  (1<<4)
#define EVENT_GRAPH_UPDATE			(1<<5)
#define EVENT_HEATER_UPDATE			(1<<6)

#define UI_GRAPH_MAX_TEMP 320
#define UI_GRAPH_MIN_TEMP 200
#define UI_PANEL_HEIGHT 34
#define UI_GRAPH_WIDTH SCREEN_WIDTH
#define UI_GRAPH_HEIGHT (SCREEN_HEIGHT - UI_PANEL_HEIGHT - 1)
#define UI_GRAPH_TEMP_RANGE ((float)(UI_GRAPH_MAX_TEMP - UI_GRAPH_MIN_TEMP))
#define UI_GRAPH_HEIGHT_SCALE ((float)UI_GRAPH_HEIGHT / UI_GRAPH_TEMP_RANGE)
#define UI_GRAPH_GUIDE_INTERVAL 30
#define UI_GRAPH_GUIDE_COLOR ST7735_GREY
#define UI_PANEL_COLOR ST7735_BLUE
#define UI_TEXT_COLOR ST7735_WHITE
#define UI_TEXT_BG_COLOR ST7735_BLACK
#define UI_MARKER_COLOR ST7735_RED
#define UI_MODE_SELECT  0
#define UI_MODE_EDIT    1

#define FONT_WIDTH   5
#define FONT_HEIGHT  7

#define VARIABLES_NUMBER 5
#define VARIABLE_MAX_DIGITS 5

#define TIM1_FREQUENCY 500
#define GRAPH_UPDATE_DELAY_TIM1 1000
#define HEATER_UPDATE_DELAY_TIM1 500

#define THERM_R_25K 100000.0f
#define THERM_BETA 4410.0f
#define THERM_0K 273.15f
// 985
#define THERM_ADC_MAX 1023
#define THERM_R2 150.0f

#define I_MAX  5.0f

#define HEATER_PWM_PERIOD_MAX 976

#define MOTOR_PORT GPIOA
#define MOTOR_PIN GPIO_PIN_3
#define MOTOR_SPEED_SLOW 250

#define TIM4_ARR(speed) (16000000UL / 2 / 128 / (speed))

enum VariableIndexes {
	VARIABLE_TEMP,
	VARIABLE_SPD,
	VARIABLE_KP,
	VARIABLE_KI,
	VARIABLE_KD
};

enum LetterIndexes {
	LETTER_T,
	LETTER_E,
	LETTER_M,
	LETTER_P,
	LETTER_S,
	LETTER_D,
	LETTER_K,
	LETTER_I
};

static const uint8_t ST7735_InitTable[] = {
	0x01, 0,              // SWRESET
	ST7735_DELAY, 150,

	0x11, 0,              // SLPOUT
	ST7735_DELAY, 150,

	0xB1, 3, 0x01, 0x2C, 0x2D,
	0xB2, 3, 0x01, 0x2C, 0x2D,
	0xB3, 6, 0x01, 0x2C, 0x2D, 0x01, 0x2C, 0x2D,

	0xB4, 1, 0x07,

	0xC0, 3, 0xA2, 0x02, 0x84,
	0xC1, 1, 0xC5,
	0xC2, 2, 0x0A, 0x00,
	0xC3, 2, 0x8A, 0x2A,
	0xC4, 2, 0x8A, 0xEE,
	0xC5, 1, 0x0E,

	0x20, 0,

	0x36, 1, 0xC0,

	0x3A, 1, 0x05,

	0xE0, 16,
	0x02, 0x1C, 0x07, 0x12,
	0x37, 0x32, 0x29, 0x2D,
	0x29, 0x25, 0x2B, 0x39,
	0x00, 0x01, 0x03, 0x10,

	0xE1, 16,
	0x03, 0x1D, 0x07, 0x06,
	0x2E, 0x2C, 0x29, 0x2D,
	0x2E, 0x2E, 0x37, 0x3F,
	0x00, 0x00, 0x02, 0x10,

	0x13, 0,
	ST7735_DELAY, 10,

	0x29, 0,
	ST7735_DELAY, 100
};

static const uint8_t letters[8][FONT_HEIGHT] = {
    // T
    {
        0b11111,
        0b00100,
        0b00100,
        0b00100,
        0b00100,
        0b00100,
        0b00100
    },
    // E
    {
        0b11111,
        0b10000,
        0b10000,
        0b11110,
        0b10000,
        0b10000,
        0b11111
    },
    // M
    {
        0b10001,
        0b11011,
        0b10101,
        0b10101,
        0b10001,
        0b10001,
        0b10001
    },
    // P
    {
        0b11110,
        0b10001,
        0b10001,
        0b11110,
        0b10000,
        0b10000,
        0b10000
    },
    // S
    {
        0b01111,
        0b10000,
        0b10000,
        0b01110,
        0b00001,
        0b00001,
        0b11110
    },
    // D
    {
        0b11110,
        0b10001,
        0b10001,
        0b10001,
        0b10001,
        0b10001,
        0b11110
    },
    // K
    {
        0b10001,
        0b10010,
        0b10100,
        0b11000,
        0b10100,
        0b10010,
        0b10001
    },
    // I
    {
        0b11111,
        0b00100,
        0b00100,
        0b00100,
        0b00100,
        0b00100,
        0b11111
    }
};

static const uint8_t digits[10][FONT_HEIGHT] = {
    // 0
    {
        0b01110,
        0b10001,
        0b10011,
        0b10101,
        0b11001,
        0b10001,
        0b01110
    },
    // 1
    {
        0b00100,
        0b01100,
        0b00100,
        0b00100,
        0b00100,
        0b00100,
        0b01110
    },
    // 2
    {
        0b01110,
        0b10001,
        0b00001,
        0b00010,
        0b00100,
        0b01000,
        0b11111
    },
    // 3
    {
        0b11110,
        0b00001,
        0b00001,
        0b01110,
        0b00001,
        0b00001,
        0b11110
    },
    // 4
    {
        0b00010,
        0b00110,
        0b01010,
        0b10010,
        0b11111,
        0b00010,
        0b00010
    },
    // 5
    {
        0b11111,
        0b10000,
        0b10000,
        0b11110,
        0b00001,
        0b00001,
        0b11110
    },
    // 6
    {
        0b01110,
        0b10000,
        0b10000,
        0b11110,
        0b10001,
        0b10001,
        0b01110
    },
    // 7
    {
        0b11111,
        0b00001,
        0b00010,
        0b00100,
        0b01000,
        0b01000,
        0b01000
    },
    // 8
    {
        0b01110,
        0b10001,
        0b10001,
        0b01110,
        0b10001,
        0b10001,
        0b01110
    },
    // 9
    {
        0b01110,
        0b10001,
        0b10001,
        0b01111,
        0b00001,
        0b00001,
        0b01110
    }
};

