CassiniSea/lcd-st7735-stm8s/main.c
static const uint8_t label_TEMP[] = {
	LETTER_T,
	LETTER_E,
	LETTER_M,
	LETTER_P
};

static const uint8_t label_SPD[] = {
	LETTER_S,
	LETTER_P,
	LETTER_D
};

static const uint8_t label_KP[] = {
	LETTER_K,
	LETTER_P
};

static const uint8_t label_KI[] = {
	LETTER_K,
	LETTER_I
};

static const uint8_t label_KD[] = {
	LETTER_K,
	LETTER_D
};

uint8_t graphValues[UI_GRAPH_WIDTH] = {0};

typedef struct {
	uint8_t current;
	uint8_t prev;
} VerticalGuidePosition_TypeDef;

typedef void (*VariableOnUpdate_TypeDef)(uint16_t value);

typedef struct {
	uint16_t minValue;
	uint16_t maxValue;
	uint8_t x;
	uint8_t y;
	uint8_t valueIndent;
	const uint8_t* label;
	uint8_t label_len;
	VariableOnUpdate_TypeDef onUpdate;
} VariableSettings_TypeDef;

void onSpeedUpdate(uint16_t value) {
	TIM4_SetAutoreload(TIM4_ARR(value));
}

uint16_t variablesValues[VARIABLES_NUMBER] = {
	0,	// temp
	0,	// spd
	0,	// kp
	0,	// ki
	0		// kd
};

const VariableSettings_TypeDef variablesSettings[VARIABLES_NUMBER] = {
	{0, 320, 10, SCREEN_HEIGHT - 2 * (FONT_HEIGHT + 3), 30, label_TEMP, 4, 0}, 														// temp
	{MOTOR_SPEED_SLOW, 30000, 10, SCREEN_HEIGHT - (FONT_HEIGHT + 3), 30, label_SPD, 3, onSpeedUpdate},		// spd
	{0, 0xFFFF, 90, SCREEN_HEIGHT - 3* (FONT_HEIGHT + 3), 20, label_KP, 2, 0}, 														// kp
	{0, 0xFFFF, 90, SCREEN_HEIGHT - 2* (FONT_HEIGHT + 3), 20, label_KI, 2, 0}, 														// ki
	{0, 0xFFFF, 90, SCREEN_HEIGHT - (FONT_HEIGHT + 3), 20, label_KD, 2, 0}																// kd
};

// uint8_t scroll_position = SCREEN_HEIGHT - GRAPH_TOP - GRAPH_HEIGHT;
uint8_t buttonsDebounce = 0;
uint8_t programEvent = 0;

uint8_t ui_mode = UI_MODE_SELECT;

uint8_t selected_variable = VARIABLE_TEMP;
uint8_t selected_digit = 0;
uint8_t graphGuidePosition = 0;
uint16_t graphDelay = GRAPH_UPDATE_DELAY_TIM1;
uint16_t heaterDelay = HEATER_UPDATE_DELAY_TIM1;
uint16_t heaterPwmDuty;

float temperature;

void SPI_SendByte(uint8_t data) {
	SPI_SendData(data);

	while (SPI_GetFlagStatus(SPI_FLAG_TXE) == RESET) {
	}

	while (SPI_GetFlagStatus(SPI_FLAG_BSY) == SET) {
	}
}

void ST7735_WriteCommand(uint8_t command) {
	GPIO_WriteLow(ST7735_PORT, ST7735_A0_PIN);

	SPI_SendByte(command);
}

void ST7735_WriteData(uint8_t data) {
	GPIO_WriteHigh(ST7735_PORT, ST7735_A0_PIN);

	SPI_SendByte(data);
}

void ST7735_CS_Low(void) {
	GPIO_WriteLow(ST7735_PORT, ST7735_CS_PIN);
}

void ST7735_CS_High(void) {
	GPIO_WriteHigh(ST7735_PORT, ST7735_CS_PIN);
}

void delay_ms(uint16_t ms) {
	uint16_t i;

	while (ms--) {
		for (i = 0; i < 1000; i++) {
			nop();
		}
	}
}

void ST7735_RunInitTable(void) {
	uint8_t i;
	uint8_t j;
	uint8_t command;
	uint8_t count;

	i = 0;

	while (i < sizeof(ST7735_InitTable)) {
		command = ST7735_InitTable[i++];

		if (command == ST7735_DELAY) {
			delay_ms(ST7735_InitTable[i++]);
			continue;
		}

		ST7735_WriteCommand(command);

		count = ST7735_InitTable[i++];

		for (j = 0; j < count; j++)	{
			ST7735_WriteData(ST7735_InitTable[i++]);
		}
	}
}

void ST7735_Init(void) {
	GPIO_Init(
		ST7735_PORT,
		ST7735_CS_PIN | ST7735_A0_PIN,
		GPIO_MODE_OUT_PP_HIGH_FAST
	);
	
	SPI_Init(
    SPI_FIRSTBIT_MSB,
    SPI_BAUDRATEPRESCALER_2,
    SPI_MODE_MASTER,
    SPI_CLOCKPOLARITY_LOW,
    SPI_CLOCKPHASE_1EDGE,
    SPI_DATADIRECTION_1LINE_TX,
    SPI_NSS_SOFT,
    0x07
	);
	
	SPI_Cmd(ENABLE);
	
	ST7735_CS_Low();

	ST7735_RunInitTable();

	ST7735_CS_High();
}

void ST7735_SetAddressWindow(
    uint8_t x0,
    uint8_t y0,
    uint8_t x1,
    uint8_t y1
)
{
    ST7735_WriteCommand(0x2A);

    ST7735_WriteData(0x00);
    ST7735_WriteData(x0);

    ST7735_WriteData(0x00);
    ST7735_WriteData(x1);


    ST7735_WriteCommand(0x2B);

    ST7735_WriteData(0x00);
    ST7735_WriteData(y0);

    ST7735_WriteData(0x00);
    ST7735_WriteData(y1);


    ST7735_WriteCommand(0x2C);
}

/*
void ST7735_FillScreen(uint16_t color)
{
    uint16_t i;
    uint16_t pixel_count;

    ST7735_CS_Low();

    ST7735_SetAddressWindow(0, 0, 127, 159);

    pixel_count = 128 * 160;

    for (i = 0; i < pixel_count; i++)
    {
        ST7735_WriteData(color >> 8);
        ST7735_WriteData(color & 0xFF);
    }

    ST7735_CS_High();
}
*/

void ST7735_FillRect(
    uint8_t x,
    uint8_t y,
    uint8_t width,
    uint8_t height,
    uint16_t color
)
{
    uint16_t i;
    uint16_t pixel_count;

    ST7735_CS_Low();

    ST7735_SetAddressWindow(
        x,
        y,
        x + width - 1,
        y + height - 1
    );

    pixel_count = (uint16_t)width * height;

    for (i = 0; i < pixel_count; i++)
    {
        ST7735_WriteData(color >> 8);
        ST7735_WriteData(color & 0xFF);
    }

    ST7735_CS_High();
}

uint8_t diff(uint8_t a, uint8_t b) {
	if (a > b)
    return a - b;
	else
		return b - a;
}

void ST7735_FillRectByCoordinates(
    uint8_t x1,
    uint8_t y1,
    uint8_t x2,
    uint8_t y2,
    uint16_t color
)
{
    uint8_t start_x, start_y;
    uint8_t width, height;

    // 1. Находим начальную (левую верхнюю) точку по X и ширину
    if (x1 > x2) {
        start_x = x2;
        width = x1 - x2 + 1; // +1, так как координаты включительные
    } else {
        start_x = x1;
        width = x2 - x1 + 1;
    }

    // 2. Находим начальную (левую верхнюю) точку по Y и высоту
    if (y1 > y2) {
        start_y = y2;
        height = y1 - y2 + 1;
    } else {
        start_y = y1;
        height = y2 - y1 + 1;
    }

    // 3. Вызываем базовую функцию отрисовки прямоугольника
    ST7735_FillRect(start_x, start_y, width, height, color);
}

/*
void ST7735_SetScrollArea(
    uint16_t top_fixed,
    uint16_t scroll_height,
    uint16_t bottom_fixed
)
{
    ST7735_CS_Low();

    ST7735_WriteCommand(0x33);       // VSCRDEF

    ST7735_WriteData(top_fixed >> 8);
    ST7735_WriteData(top_fixed & 0xFF);

    ST7735_WriteData(scroll_height >> 8);
    ST7735_WriteData(scroll_height & 0xFF);

    ST7735_WriteData(bottom_fixed >> 8);
    ST7735_WriteData(bottom_fixed & 0xFF);

    ST7735_CS_High();
}

void ST7735_SetScrollStart(uint16_t position)
{
    ST7735_CS_Low();

    ST7735_WriteCommand(0x37);       // VSCSAD

    ST7735_WriteData(position >> 8);
    ST7735_WriteData(position & 0xFF);

    ST7735_CS_High();
}
*/

void ST7735_SetRotation(uint8_t rotation) {
    ST7735_CS_Low();

    ST7735_WriteCommand(0x36);

    switch (rotation) {
        case 0:
            ST7735_WriteData(0x00);
            break;

        case 1:
            ST7735_WriteData(0x60);
            break;

