CassiniSea/lcd-st7735-stm8s/main.c
        case 2:
            ST7735_WriteData(0xC0);
            break;

        case 3:
            ST7735_WriteData(0xA0);
            break;
    }

    ST7735_CS_High();
}

void ST7735_DrawBitmap(
    uint8_t x,
    uint8_t y,
    const uint8_t *bitmap,
    uint8_t width,
    uint8_t height,
    uint16_t color,
    uint16_t bg_color
)
{
    uint8_t row;
    uint8_t column;
    uint8_t data;
    uint16_t pixel_color;
		
		ST7735_CS_Low();

    ST7735_SetAddressWindow(
        x,
        y,
        x + width - 1,
        y + height - 1
    );

    ST7735_WriteCommand(0x2C);   // RAMWR

    for (row = 0; row < height; row++)
    {
        data = bitmap[row];

        for (column = 0; column < width; column++)
        {
            if (data & (1 << (width - 1 - column)))
                pixel_color = color;
            else
                pixel_color = bg_color;

            ST7735_WriteData(pixel_color >> 8);
            ST7735_WriteData(pixel_color & 0xFF);
        }
    }

    ST7735_CS_High();
}


void UI_DrawText(
    uint8_t x,
    uint8_t y,
    const uint8_t *text,
    uint8_t length,
    uint16_t color,
    uint16_t bg_color
) {
    uint8_t i;

    for (i = 0; i < length; i++)
    {
        ST7735_DrawBitmap(
            x + i * 6,
            y,
            letters[text[i]],
            FONT_WIDTH,
            FONT_HEIGHT,
            color,
            bg_color
        );
    }
}

void UI_DrawNumber(
    uint8_t x,
    uint8_t y,
    uint16_t value,
    uint16_t color,
    uint16_t bg_color
)
{
    uint8_t digits_count;
    uint8_t digit;
    uint8_t position;
    uint16_t divisor;

    if (value >= 10000)
    {
        digits_count = 5;
    }
    else if (value >= 1000)
    {
        digits_count = 4;
    }
    else if (value >= 100)
    {
        digits_count = 3;
    }
    else if (value >= 10)
    {
        digits_count = 2;
    }
    else
    {
        digits_count = 1;
    }

    /*
     * Всегда выводим поле из 5 символов.
     * Ведущие позиции просто заливаем фоном.
     */
    for (position = 0; position < 5; position++)
    {
        if (position < (5 - digits_count))
        {
            ST7735_FillRect(
                x + position * 6,
                y,
                FONT_WIDTH,
                FONT_HEIGHT,
                bg_color
            );
        }
        else
        {
            divisor = 1;

            for (digit = 1; digit < (digits_count - (position - (5 - digits_count))); digit++)
            {
                divisor *= 10;
            }

            digit = value / divisor;
            value %= divisor;

            ST7735_DrawBitmap(
                x + position * 6,
                y,
                digits[digit],
                FONT_WIDTH,
                FONT_HEIGHT,
                color,
                bg_color
            );
        }
    }
}

void UI_DrawVariable(uint8_t variableIndex) {
	VariableSettings_TypeDef variableSettings = variablesSettings[variableIndex];
	
	UI_DrawText(
    variableSettings.x,
    variableSettings.y,
    variableSettings.label,
    variableSettings.label_len,
    UI_TEXT_COLOR,
    UI_TEXT_BG_COLOR
	);
	
	UI_DrawNumber(
    variableSettings.x + variableSettings.valueIndent,
    variableSettings.y,
    variablesValues[variableIndex],
    UI_TEXT_COLOR,
    UI_TEXT_BG_COLOR
	);
}

void UI_DrawVariables(void) {
	uint8_t variableIndex;
	
	for (variableIndex = 0; variableIndex < VARIABLES_NUMBER; variableIndex++) {
		UI_DrawVariable(variableIndex);		
	}
}

void UI_DrawMarker(void) {
	uint8_t variableIndex;
	uint8_t markerPosition;
	uint16_t color;
	VariableSettings_TypeDef variableSettings;
	
	for (variableIndex = 0; variableIndex < VARIABLES_NUMBER; variableIndex++) {
		if(variableIndex == selected_variable && ui_mode == UI_MODE_SELECT)
			color = UI_MARKER_COLOR;
		else 
			color = UI_PANEL_COLOR;
		
		variableSettings = variablesSettings[variableIndex];
		
		ST7735_FillRect(
			variableSettings.x - 5,
			variableSettings.y + 2,
			2,
			3,
			color
		);
		
		
		for (markerPosition = 0; markerPosition < VARIABLE_MAX_DIGITS; markerPosition++) {
			if(variableIndex == selected_variable && markerPosition == selected_digit && ui_mode == UI_MODE_EDIT)
				color = UI_MARKER_COLOR;
			else
				color = UI_PANEL_COLOR;
				
			ST7735_FillRect(
				variableSettings.x + variableSettings.valueIndent + (FONT_WIDTH + 1) * markerPosition + 1,
				variableSettings.y + FONT_HEIGHT,
				3,
				2,
				color
			);			
		}
	}
}

void variablesInit(void) {
	uint8_t variableIndex;
	
	for (variableIndex = 0; variableIndex < VARIABLES_NUMBER; variableIndex++) {
		variablesValues[variableIndex] = eepromReadU16(
			EEPROM_DEFAULT_ADDR + 2 * variableIndex,
			0
		);
	}	
}

void graphPushValue(uint8_t newValue) {
    uint8_t i;
		
		graphGuidePosition++;			
		if (graphGuidePosition >= UI_GRAPH_GUIDE_INTERVAL)
			graphGuidePosition = 0;

    // Идем с конца массива к началу
    // Элемент [i] принимает значение элемента [i - 1]
    for (i = UI_GRAPH_WIDTH - 1; i > 0; i--) {
        graphValues[i] = graphValues[i - 1];
    }

    // Записываем новое значение в самый первый элемент
    graphValues[0] = newValue;
}

uint8_t graphScaledValue(float graphValue) {
	float relativeValue;
	
	// Ограничиваем входное значение жестко рамками [200 ... 350]
  if (graphValue > UI_GRAPH_MAX_TEMP) graphValue = UI_GRAPH_MAX_TEMP;
  if (graphValue < UI_GRAPH_MIN_TEMP) graphValue = UI_GRAPH_MIN_TEMP;
	
	// Вычитаем минимальную температуру, чтобы график начинался от UI_GRAPH_MIN_TEMP
	relativeValue = graphValue - (float)UI_GRAPH_MIN_TEMP;
	
	return UI_GRAPH_HEIGHT - (uint8_t)(relativeValue * UI_GRAPH_HEIGHT_SCALE);
}

VerticalGuidePosition_TypeDef getVerticalGuidePosition(void) {
	static VerticalGuidePosition_TypeDef verticalGuidePosition = {0, 0};
	uint16_t tempValue = variablesValues[VARIABLE_TEMP];
	
	if(tempValue > UI_GRAPH_MAX_TEMP)
		tempValue = UI_GRAPH_MAX_TEMP;
	
	verticalGuidePosition.prev = verticalGuidePosition.current;
	verticalGuidePosition.current = graphScaledValue(tempValue);
	
