CassiniSea/lcd-st7735-stm8s/main.c
	return verticalGuidePosition;
}

void UI_DrawGraph(void) {
	uint8_t i;
	VerticalGuidePosition_TypeDef verticalGuidePosition = getVerticalGuidePosition();
	
	ST7735_FillRect(
		2,
		0,
		1,
		UI_GRAPH_HEIGHT,
		ST7735_BLACK
	);	
	
	if(verticalGuidePosition.current != verticalGuidePosition.prev) {
		ST7735_FillRect(
			0,
			verticalGuidePosition.prev,
			SCREEN_WIDTH,
			1,
			ST7735_BLACK
		);
	}
	
	for(i = graphGuidePosition; i < UI_GRAPH_WIDTH - 1; i += UI_GRAPH_GUIDE_INTERVAL) {
		ST7735_FillRect(
			UI_GRAPH_WIDTH - i + 1,
			0,
			1,
			UI_GRAPH_HEIGHT,
			ST7735_BLACK
		);
		ST7735_FillRect(
			UI_GRAPH_WIDTH - i,
			0,
			1,
			UI_GRAPH_HEIGHT,
			UI_GRAPH_GUIDE_COLOR
		);
	}
	
	ST7735_FillRect(
		0,
		verticalGuidePosition.current,
		SCREEN_WIDTH,
		1,
		UI_GRAPH_GUIDE_COLOR
	);
	
	for(i = 0; i < UI_GRAPH_WIDTH - 2; i++) {
		ST7735_FillRectByCoordinates(
			UI_GRAPH_WIDTH - i,
			graphValues[i+1],
			UI_GRAPH_WIDTH - i,
			graphValues[i+2],
			ST7735_BLACK
		);
		
		if(graphValues[i] > 0 && graphValues[i] < UI_GRAPH_HEIGHT && graphValues[i+1] > 0 && graphValues[i+1] < UI_GRAPH_HEIGHT) {				
			ST7735_FillRectByCoordinates(
				UI_GRAPH_WIDTH - i,
				graphValues[i],
				UI_GRAPH_WIDTH - i,
				graphValues[i+1],
				ST7735_RED
			);
		}
	}
	
	UI_DrawNumber(
		40,
		SCREEN_HEIGHT - 3 * (FONT_HEIGHT + 3),
		(uint16_t)temperature,
		ST7735_GREEN,
		UI_PANEL_COLOR
	);
}

float getHeaterTemperature(void) {
	float rTherm = THERM_R2/(THERM_ADC_MAX/(float)ADC1_GetConversionValue() - 1);
	return (THERM_BETA * (THERM_0K + 25))/(THERM_BETA + (THERM_0K + 25) * log(rTherm / THERM_R_25K)) - THERM_0K;		
}

void updateVariable(uint8_t variableNumber, uint16_t value) {
	variablesValues[variableNumber] = value;
	if(variablesSettings[variableNumber].onUpdate)
		variablesSettings[variableNumber].onUpdate(value);
}

uint8_t getButtonsState(void) {
    uint8_t state = 0;

    if (GPIO_ReadInputPin(GPIOC, GPIO_PIN_3) == RESET)
      state |= EVENT_BUTTON_1_PRESSED;
				
		if (GPIO_ReadInputPin(GPIOC, GPIO_PIN_7) == RESET)
      state |= EVENT_BUTTON_2_PRESSED;

		if (GPIO_ReadInputPin(GPIOA, GPIO_PIN_1) == RESET)
      state |= EVENT_BUTTON_3_PRESSED;
			
		if (GPIO_ReadInputPin(GPIOA, GPIO_PIN_2) == RESET)
			state |= EVENT_BUTTON_4_PRESSED;

    return state;
}

void button1Routine(void) {
	uint16_t increment;
	
	//if(variables[VARIABLE_TEMP].value < 0xFFFF)
		//variables[VARIABLE_TEMP].value++;
		
	//UI_DrawVariable(variables[VARIABLE_TEMP]);
	
	if(ui_mode == UI_MODE_SELECT) {
		if(selected_variable > 0)
			selected_variable -= 1;
		else 
			selected_variable = VARIABLES_NUMBER - 1;
	}
	else if(ui_mode == UI_MODE_EDIT) {
    switch (selected_digit) {
			case 0: increment = 10000; break;
			case 1: increment = 1000;  break;
			case 2: increment = 100;   break;
			case 3: increment = 10;    break;
			default: increment = 1;    break;
    }
		
		if (variablesValues[selected_variable] > (variablesSettings[selected_variable].maxValue - increment)) {
			updateVariable(selected_variable, variablesSettings[selected_variable].maxValue);
		} else {
			updateVariable(selected_variable, variablesValues[selected_variable] + increment);
		}
		
		UI_DrawVariables();
	}
		
	UI_DrawMarker();
}

void button2Routine(void) {
	//GPIO_WriteReverse(GPIOB, GPIO_PIN_5);	
	//if(variables[VARIABLE_TEMP].value > 0)
		//variables[VARIABLE_TEMP].value--;
		
	//UI_DrawVariable(variables[VARIABLE_TEMP]);
	uint16_t decrement;
	
	if(ui_mode == UI_MODE_SELECT) {
		if(selected_variable < VARIABLES_NUMBER - 1)
			selected_variable += 1;
		else 
			selected_variable = 0;
	}
	else if(ui_mode == UI_MODE_EDIT) {
    switch (selected_digit) {
			case 0: decrement = 10000; break;
			case 1: decrement = 1000;  break;
			case 2: decrement = 100;   break;
			case 3: decrement = 10;    break;
			default: decrement = 1;    break;
    }
		
		if (decrement > variablesValues[selected_variable] - variablesSettings[selected_variable].minValue) {
			updateVariable(selected_variable, variablesSettings[selected_variable].minValue);
		} else {
			updateVariable(selected_variable, variablesValues[selected_variable] - decrement);
		}
		
		UI_DrawVariables();
	}
		
	UI_DrawMarker();
}

void button3Routine(void) {
	//GPIO_WriteReverse(GPIOB, GPIO_PIN_5);	
	//if(variables[VARIABLE_TEMP].value < 0xFFFF - 100)
		//variables[VARIABLE_TEMP].value += 100;
		
	//UI_DrawVariable(variables[VARIABLE_TEMP]);
	if(selected_digit == 0) {
		ui_mode = UI_MODE_SELECT;
		eepromWriteU16(EEPROM_DEFAULT_ADDR + 2 * selected_variable, variablesValues[selected_variable]);
	}	else
		selected_digit--;
	
	UI_DrawMarker();
}

void button4Routine(void) {
	//GPIO_WriteReverse(GPIOB, GPIO_PIN_5);	
	//if(variables[VARIABLE_TEMP].value > 100)
		//variables[VARIABLE_TEMP].value -= 100;
		
	//UI_DrawVariable(variables[VARIABLE_TEMP]);
	if(ui_mode == UI_MODE_SELECT)
		ui_mode = UI_MODE_EDIT;
	else if(ui_mode == UI_MODE_EDIT) {		
		if(selected_digit < VARIABLE_MAX_DIGITS - 1)
			selected_digit++;
		else {
			updateVariable(selected_variable, eepromReadU16(EEPROM_DEFAULT_ADDR + 2 * selected_variable, 0));
			UI_DrawVariables();
		}
	}
	
	UI_DrawMarker();
}

main() {
	uint8_t x;
	uint8_t test;
	
	CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1|CLK_PRESCALER_CPUDIV1);
	CLK_PeripheralClockConfig(CLK_PERIPHERAL_SPI, ENABLE);
	CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER2, ENABLE);
	
	ST7735_Init();
	ST7735_SetRotation(1);
	/*	
	ST7735_SetScrollArea(
    10,
    120,
    30
	);
	*/
	
	uartInit();
	
	GPIO_Init(GPIOB, GPIO_PIN_4 | GPIO_PIN_5, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_Init(MOTOR_PORT, MOTOR_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	
	EXTI_SetExtIntSensitivity(
		EXTI_PORT_GPIOA,
		EXTI_SENSITIVITY_FALL_ONLY
	);	
	GPIO_Init(GPIOA, GPIO_PIN_1 | GPIO_PIN_2, GPIO_MODE_IN_PU_IT);
	
	EXTI_SetExtIntSensitivity(
		EXTI_PORT_GPIOC,
		EXTI_SENSITIVITY_FALL_ONLY
	);	
	GPIO_Init(GPIOC, GPIO_PIN_3 | GPIO_PIN_7, GPIO_MODE_IN_PU_IT);

	TIM4_TimeBaseInit(TIM4_PRESCALER_128, TIM4_ARR(MOTOR_SPEED_SLOW));
	TIM4_ITConfig(TIM4_IT_UPDATE, ENABLE);
	TIM4_Cmd(ENABLE);
	
	ADC1_Init(	ADC1_CONVERSIONMODE_CONTINUOUS,
							ADC1_CHANNEL_2,
							ADC1_PRESSEL_FCPU_D4,
							ADC1_EXTTRIG_TIM,
							DISABLE,
							ADC1_ALIGN_RIGHT,
							ADC1_SCHMITTTRIG_CHANNEL3,
							DISABLE);
	ADC1_Cmd(ENABLE);
	ADC1_StartConversion();
	
