CassiniSea/lcd-st7735-stm8s/main.c
	TIM1_TimeBaseInit(16000, TIM1_COUNTERMODE_UP, 1000/TIM1_FREQUENCY, 0);
	TIM1_ITConfig(TIM1_IT_UPDATE, ENABLE);
	
	TIM2_TimeBaseInit(	TIM2_PRESCALER_16384,
											HEATER_PWM_PERIOD_MAX);
	TIM2_OC1Init(				TIM2_OCMODE_PWM2,
											TIM2_OUTPUTSTATE_ENABLE,
											0,
											TIM2_OCPOLARITY_HIGH);
	TIM2_OC1PreloadConfig(ENABLE); 
	TIM2_ARRPreloadConfig(ENABLE);
	
	enableInterrupts();
	
	ST7735_FillRect(
		0,
		0,
		SCREEN_WIDTH,
		SCREEN_HEIGHT - UI_PANEL_HEIGHT,
		ST7735_BLACK
	);
	
	ST7735_FillRect(
    0,
    SCREEN_HEIGHT - UI_PANEL_HEIGHT,
    SCREEN_WIDTH,
    UI_PANEL_HEIGHT,
    UI_PANEL_COLOR
	);
	
	/*
	ST7735_FillRect(0,   0,   40, 40, ST7735_RED);
	ST7735_FillRect(98,  0,   40, 40, ST7735_GREEN);
	ST7735_FillRect(0,   120, 40, 40, ST7735_BLUE);
	ST7735_FillRect(88,  120, 40, 40, ST7735_WHITE);
	/*
	
	/*	
	ST7735_FillRect(
    0,
    GRAPH_TOP + GRAPH_HEIGHT,
    GRAPH_WIDTH,
    SCREEN_HEIGHT - GRAPH_TOP - GRAPH_HEIGHT,
    ST7735_GREEN
	);
	*/
	
	/*
	for (x = 0; x < SCREEN_WIDTH; x += 10)	{
		ST7735_FillRect(
			x,
			GRAPH_TOP,
			5,
			GRAPH_HEIGHT,
			ST7735_RED
		);
	}
	*/
	
	variablesInit();
	
	UI_DrawVariables();
	UI_DrawMarker();
	
	TIM2_Cmd(ENABLE);
	TIM1_Cmd(ENABLE);	
	
	while (1) {
		uint16_t heaterMarkerColor = UI_PANEL_COLOR;
		
		if(programEvent & EVENT_BUTTON_1_PRESSED) {
			button1Routine();
			programEvent &= ~EVENT_BUTTON_1_PRESSED;
		}
		
		if(programEvent & EVENT_BUTTON_2_PRESSED) {
			button2Routine();
			programEvent &= ~EVENT_BUTTON_2_PRESSED;
		}
		
		if(programEvent & EVENT_BUTTON_3_PRESSED) {
			button3Routine();
			programEvent &= ~EVENT_BUTTON_3_PRESSED;
		}
		
		if(programEvent & EVENT_BUTTON_4_PRESSED) {
			button4Routine();
			programEvent &= ~EVENT_BUTTON_4_PRESSED;
		}
		
		if(programEvent & EVENT_GRAPH_UPDATE) {
			UI_DrawGraph();			
			programEvent &= ~EVENT_GRAPH_UPDATE;
		}
		
		if(GPIO_ReadInputPin(GPIOD, GPIO_PIN_4) == RESET)
			heaterMarkerColor = ST7735_RED;

		ST7735_FillRect(
			10,
			SCREEN_HEIGHT - 3 * (FONT_HEIGHT + 3),
			FONT_HEIGHT,
			FONT_HEIGHT,
			heaterMarkerColor
		);
	}

}

@far @interrupt void tim1UpdateInterrupt(void) {	
	if (buttonsDebounce) {
    buttonsDebounce--;

    if (buttonsDebounce == 0) {
			programEvent |= getButtonsState();
    }
	}	
	
	heaterDelay++;
	if(heaterDelay > HEATER_UPDATE_DELAY_TIM1) {
		static float pid_prev_error = 0.0f;
		static float pid_integral = 0.0f;
		float error, p_term, d_term, output;
    float kp = (float)variablesValues[VARIABLE_KP];
    float ki = (float)variablesValues[VARIABLE_KI];
    float kd = (float)variablesValues[VARIABLE_KD];
		
		heaterDelay = 0;

		temperature = getHeaterTemperature();
		
    // Считаем ошибку		
    error = (float)variablesValues[VARIABLE_TEMP] - temperature;
		
		// Пропорциональная составляющая
    p_term = kp * error;
		
		// Интегральная составляющая
    //pid_integral += ki * error;		
		if (error < 10.0f && error > -10.0f) {
				// Интегратор работает только в пределах +-10 градусов от цели
				pid_integral += ki * error; 
		} 
		else {
				// Пока мы далеко от цели, сбрасываем интегратор, чтобы он не копил мусор
				pid_integral = 0.0f; 
		}
    // Анти-виндэп (Anti-windup): ограничиваем интеграл, чтобы он не "разгонялся"
    if (pid_integral > HEATER_PWM_PERIOD_MAX * 0.6f) pid_integral = HEATER_PWM_PERIOD_MAX * 0.6f;
    else if (pid_integral < 0.0f) pid_integral = 0.0f;
		
		// Дифференциальная составляющая
    d_term = kd * (error - pid_prev_error);
    pid_prev_error = error;
		
		// Суммируем выходное значение
    output = p_term + pid_integral + d_term;
		
		// Ограничиваем выход под рамки ARR таймера (0 - 1250)
    heaterPwmDuty = 0;
    if (output >= (float)HEATER_PWM_PERIOD_MAX) {
        heaterPwmDuty = HEATER_PWM_PERIOD_MAX + 1;
    } else if (output <= 0.0f) {
        heaterPwmDuty = 0;
    } else {
        heaterPwmDuty = (uint16_t)output;
    }
		
		// Обновляем ШИМ регистра таймера
    TIM2_SetCompare1(heaterPwmDuty);
	}
	
	graphDelay++;
	if(graphDelay > GRAPH_UPDATE_DELAY_TIM1) {
		graphDelay = 0;
		programEvent |= EVENT_GRAPH_UPDATE;
		graphPushValue(graphScaledValue(temperature));
	}
	
	TIM1_ClearITPendingBit(TIM1_IT_UPDATE);
	//graphPushValue();
	
	/*	
	scroll_position++;
	if (scroll_position >= SCREEN_HEIGHT - GRAPH_TOP) {
		scroll_position = SCREEN_HEIGHT - GRAPH_TOP - GRAPH_HEIGHT;
	}
	
	if(isInitComplate == TRUE) {	
		ST7735_SetScrollStart(scroll_position);
	}
	*/
}

@far @interrupt void tim4UpdateInterrupt(void) {
	TIM4_ClearITPendingBit(TIM1_IT_UPDATE);
	GPIO_WriteReverse(MOTOR_PORT, MOTOR_PIN);
}

@far @interrupt void gpioaExtiInterrupt(void) {
	buttonsDebounce = BUTTONS_DEBOUNCE_LIMIT;
}

@far @interrupt void gpiocExtiInterrupt(void) {	
	buttonsDebounce = BUTTONS_DEBOUNCE_LIMIT;
}

void uartReceiveByte(uint8_t byte) {
	uartSendByte(byte);
//	ST7735_SetScrollStart((uint16_t)byte);
}